#### Importado y exportado de archivos csv

Primera parte del MySQL_MovieProject

In [1]:
import pandas as pd # Importamos las librerías
import numpy as np
import re
from datetime import datetime

In [2]:
pd.set_option('display.max_columns', None)  # ver todas las columnas

In [3]:
path = '../data/rental.csv'

rental = pd.read_csv(path)

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [4]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

* Con estas primeras 5 filas podemos ver que la fecha en la que se actualizan los nombres de cada actor son iguales. 
* Voy a comprobar si la varianza en la columna es baja o si hay pocos valores únicos si son todos iguales me voy a deshacer de ella.
* Parece que no hay ningún valor nulo
* Las columnas `rental_date` y `return_date` tienen tipo objeto - voy a pasarlas a tipo date time y crear tres columnas distintas year, month y day. Creo será util de cara a los querrys de luego.

In [5]:
# Procedo a ver los valores únicos de la columna:
rental.last_update.unique()

array(['2006-02-15 21:30:53'], dtype=object)

* Solo hay un tipo de valor en toda la columna -> me la puedo quitar con total confianza -> no nos aporta nada saber que los datos de los actores se actualizaron todos el mismo día y a la misma hora

In [6]:
rental.drop(columns='last_update', inplace=True)
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [7]:
rental.shape

(1000, 6)

In [8]:
# Si son solo 16 voy a mostrarlos todos para echarles un ojo:
rental.head(16)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2
10,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2
11,12,2005-05-25 00:19:27,1584,261,2005-05-30 05:44:27,2
12,13,2005-05-25 00:22:55,2294,334,2005-05-30 04:28:55,1
13,14,2005-05-25 00:31:15,2701,446,2005-05-26 02:56:15,1
14,15,2005-05-25 00:39:22,3049,319,2005-06-03 03:30:22,1
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2

Voy a pasar las columnas

In [10]:
#category.isnull().sum() # Comprobamos si hay nulos

category_id    0
name           0
dtype: int64

In [11]:
# Vamos a borrar duplicados si los hubiera:
#category.drop_duplicates(inplace=True)

In [12]:
# Pasamos el csv a nuestra carpeta data,llamándolo igual pero con un '_clean'
#category.to_csv('../data/category_clean.csv', index=False)